index.html
<!doctype html>
<html lang="en">
<head>
<title>SAS Macros</title>
<meta charset="utf-8">
<meta name="viewport" content="width=device-width, initial-scale=1">
<meta name="generator" content="Org-mode">
<meta name="author" content="Edwin Hu">

<link  href="https://cdnjs.cloudflare.com/ajax/libs/twitter-bootstrap/3.3.5/css/bootstrap.min.css" rel="stylesheet">
<link rel="icon" href="favicon.ico" type="image/x-icon" />
</head>
<body>
<div id="content" class="container">
<div class="row"><div class="col-md-9"><h1 class="title">SAS Macros</h1>
<p>
A collection of SAS Macros that I frequently use and occasionally update. 
</p>

<p>
The full repo can be found at <a href="http://github.com/edwinhu/sas">http://github.com/edwinhu/sas</a>
</p>

<div id="outline-container-crsp" class="outline-2">
<h2 id="crsp"><a id="sec-" name="sec-"></a>CRSP</h2>
<div class="outline-text-2" id="text-crsp">
</div>

<div id="outline-container-cclink" class="outline-3">
<h3 id="cclink"><a id="sec-" name="sec-"></a><a href="https://github.com/edwinhu/sas/blob/master/CC_LINK.sas">CC_LINK</a></h3>
<div class="outline-text-3" id="text-cclink">
<p>
Links COMPUSTAT GVKEYs to CRSP PERMNOs.
</p>

<p>
Takes a file which contains GVKEYs and dates and merges in the
appropriate PERMNOs. This handles a lot of silly merge issues.
</p>
<ul class="org-ul">
<li>dsetin: Input Dataset
</li>
<li>dsetout: Output Dataset Name, default compx
</li>
<li>datevar: date variable to use (datadate, rdq)
</li>
<li>keep_vars: variables to keep
</li>
</ul>

<div class="org-src-container">

<pre class="src src-sas"><span style="color: #339CDB;">%INCLUDE</span> <span style="color: #DB8E73;">"~/git/sas/CC_LINK.sas"</span>;
<span style="color: #D9DAA2;">%CC_LINK(</span>dsetin=&amp;syslast.,
    dsetout=compx,
    datevar=datadate,
    keep_vars=);
</pre>
</div>
</div>
</div>
</div>


<div id="outline-container-comp" class="outline-2">
<h2 id="comp"><a id="sec-" name="sec-"></a>COMPUSTAT</h2>
<div class="outline-text-2" id="text-comp">
</div>

<div id="outline-container-ead" class="outline-3">
<h3 id="ead"><a id="sec-" name="sec-"></a><a href="https://github.com/edwinhu/sas/blob/master/COMP_EAD.sas">COMP_EAD</a></h3>
<div class="outline-text-3" id="text-ead">
<p>
Gets quarterly earnings announcement dates from COMPUSTAT and fetches
CRSP PERMNOs. Makes a file <code>comp_ead_events</code>.
</p>
<ul class="org-ul">
<li>comp_vars: list of COMPUSTAT variables to fetch
</li>
<li>filter: filters to place on COMPUSTAT quarterly
</li>
</ul>

<div class="org-src-container">

<pre class="src src-sas"><span style="color: #339CDB;">%INCLUDE</span> <span style="color: #DB8E73;">"~/git/sas/COMP_EAD.sas"</span>;
<span style="color: #D9DAA2;">%COMP_EAD(</span>comp_vars=gvkey fyearq fqtr conm datadate rdq
    epsfxq epspxq
    prccq ajexq
    spiq cshoq cshprq cshfdq
    saleq atq
    fyr datafqtr,
    filter=<span style="color: #339CDB;">not</span> <span style="color: #339CDB;">missing</span>(saleq) or atq&gt;<span style="color: #B5CEA8; font-weight: bold;">0</span>
    );
</pre>
</div>
</div>
</div>
</div>


<div id="outline-container-util" class="outline-2">
<h2 id="util"><a id="sec-" name="sec-"></a>Utilities</h2>
<div class="outline-text-2" id="text-util">
</div>

<div id="outline-container-ff93" class="outline-3">
<h3 id="ff93"><a id="sec-" name="sec-"></a><a href="https://github.com/edwinhu/sas/blob/master/FF93_FACTORS.sas">FF93_FACTORS</a></h3>
<div class="outline-text-3" id="text-ff93">
<p>
Replicates Fama-French (1993) SMB &amp; HML Factors. Currently obtaining
correlations of 99.5% (SMB) 97.8% (HML) for sample period 1975 to 2019.
</p>

<p>
Also useful in case you want to get the breakpoints or portfolio compositions.
</p>
</div>
</div>

<div id="outline-container-event" class="outline-3">
<h3 id="event"><a id="sec-" name="sec-"></a><a href="https://github.com/edwinhu/sas/blob/master/EVENT_MACROS.sas">EVENT_MACROS</a></h3>
<div class="outline-text-3" id="text-event">
<p>
A collection of event study macros adapted from WRDS.
</p>

<p>
<code>%EVENT_SETUP</code> sets the global variables, including the start and end
dates of the estimation and event windows. It also sets the formula to
use for the abnormal returns.
</p>

<p>
<code>%EVENT_EXPAND</code> does the bulk of the merging of datasets, creating the
actual windows and ultimately the output file <code>&amp;prefix._expand</code>.
</p>

<p>
<code>%EVENT_STATS</code> computes abnormal returns, and then the summary
statistics. The output file <code>&amp;prefix._car</code> contains the event-window
data with abnormal returns.
</p>

<div class="org-src-container">

<pre class="src src-sas"><span style="color: #339CDB;">%INCLUDE</span> <span style="color: #DB8E73;">"~/git/sas/EVENT_MACROS.sas"</span>;
<span style="color: #D9DAA2;">%EVENT_SETUP(</span>pref=,
    crsp_lib=crspm,
    frequency=d,
    date_var=event_date,
    id_var=permno,
    <span style="color: #339CDB;">model</span>=ffm,
    ret_var=retx,
    est_per=<span style="color: #B5CEA8; font-weight: bold;">252</span>, gap_win=<span style="color: #B5CEA8; font-weight: bold;">30</span>,
    beg_win=-<span style="color: #B5CEA8; font-weight: bold;">30</span>, end_win=<span style="color: #B5CEA8; font-weight: bold;">120</span>
    );
<span style="color: #D9DAA2;">%EVENT_EXPAND(</span>lib=user, debug = n);
<span style="color: #D9DAA2;">%EVENT_STATS(</span>prefix = ,
    dsetin = ,
    group = ,
    filter = <span style="color: #339CDB;">and</span> shrcd in (<span style="color: #B5CEA8; font-weight: bold;">10</span>,<span style="color: #B5CEA8; font-weight: bold;">11</span>) <span style="color: #339CDB;">and</span> exchcd in (<span style="color: #B5CEA8; font-weight: bold;">1</span>,<span style="color: #B5CEA8; font-weight: bold;">2</span>,<span style="color: #B5CEA8; font-weight: bold;">3</span>),
    debug= = n
    );
</pre>
</div>
</div>
</div>


<div id="outline-container-asof" class="outline-3">
<h3 id="asof"><a id="sec-" name="sec-"></a><a href="https://github.com/edwinhu/sas/blob/master/MERGE_ASOF.sas">MERGE_ASOF</a></h3>
<div class="outline-text-3" id="text-asof">
<p>
Does an as-of or &ldquo;window&rdquo; merge, e.g., COMPUSTAT yearly with CRSP
monthly, or TAQ quotes with TAQ trades.
</p>

<p>
See, e.g., <a href="https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.merge_asof.html">pandas</a>, <a href="https://www.r-bloggers.com/understanding-data-table-rolling-joins/">rolling joins with <code>R data.table</code></a>, or <a href="https://code.kx.com/v2/ref/asof/">kdb+ asof</a>.
</p>

<ul class="org-ul">
<li>a: dataset a
</li>
<li>b: dataset b
</li>
<li>merged: output merged dataset
</li>
<li>idvar: firm identifier (permno)
</li>
<li>datevar: date variable to use (date)
</li>
<li>sort_statement: defaults to <code>idvar datevar</code> but can be customized
</li>
<li>num_vars: numeric variables from b to merge in
</li>
<li>char_vars: character variables from b to merge in
</li>
</ul>

<div class="org-src-container">

<pre class="src src-sas"><span style="color: #339CDB;">%INCLUDE</span> <span style="color: #DB8E73;">"~/git/sas/MERGE_ASOF.sas"</span>;
<span style="color: #D9DAA2;">%MERGE_ASOF(</span>a=,b=,
    merged=,
    num_vars=);
</pre>
</div>
</div>
</div>

<div id="outline-container-parfor" class="outline-3">
<h3 id="parfor"><a id="sec-" name="sec-"></a><a href="https://github.com/edwinhu/sas/blob/master/PARFOR.sas">PARFOR</a></h3>
<div class="outline-text-3" id="text-parfor">
<p>
A parallel FOR loop SAS Macro.
</p>

<p>
If you have huge files it is often better to use Split-Apply-Combine
processing. For example processing daily trades by year can be done
by splitting the dataset into yearly datasets and doing the processing
in a parallel FOR loop.
</p>

<p>
This Macro spawns multiple SAS processes in the background to make
parallel processing easy. The Macro waits until all processes are
complete before returning control to the user.
</p>

<p>
<b><b>WARNING:</b></b> There is no built-in resource control (RAM/CPU) so make
sure to test your code on one group at a time before spawning too many
concurrent processes!
</p>

<div class="org-src-container">

<pre class="src src-sas"><span style="color: #339CDB;">%INCLUDE</span> <span style="color: #DB8E73;">"~/git/sas/PARFOR"</span>;
<span style="color: #339CDB;">%LET</span> FUNC = <span style="color: #D9DAA2;">%STR(</span>
    <span style="color: #339CDB;">proc print</span> <span style="color: #339CDB;">data=</span>perf_&amp;yyyy.(obs=<span style="color: #B5CEA8; font-weight: bold;">25</span>);
    <span style="color: #339CDB;">var</span> exret: ret:;
    <span style="color: #339CDB;">run;</span>
);
<span style="color: #D9DAA2;">%PARFOR(</span>FUNC=&amp;FUNC.);
</pre>
</div>
</div>
</div>

<div id="outline-container-resample" class="outline-3">
<h3 id="resample"><a id="sec-" name="sec-"></a><a href="https://github.com/edwinhu/sas/blob/master/RESAMPLE.sas">RESAMPLE</a></h3>
<div class="outline-text-3" id="text-resample">
<p>
Resample and forward-fill data from low to high frequency Commonly
used to sample low frequency COMPUSTAT data before merging with higher
frequency CRSP data. It is more efficient to use <a href="https://github.com/edwinhu/sas/blob/master/MERGE_ASOF.sas">MERGE_ASOF</a> for this
specific task.
</p>

<ul class="org-ul">
<li>lib: input dataset library
</li>
<li>dsetin: input dataset
</li>
<li>dsetout: output (resampled) dataset
</li>
<li>datevar: date variable to resample
</li>
<li>idvar: group by id variable
</li>
<li>infreq: input frequency
</li>
<li>outfreq: output (higher) frequency
</li>
<li>alignment: date alignment (E,S,B)
</li>
<li>debug: keep or delete temporary datasets
</li>
</ul>

<div class="org-src-container">

<pre class="src src-sas"><span style="color: #339CDB;">%INCLUDE</span> <span style="color: #DB8E73;">"~/git/sas/RESAMPLE.sas"</span>;
<span style="color: #D9DAA2;">%RESAMPLE(</span>lib=sashelp, dsetin=citiyr, outfreq=monthly, idvar=, datevar=date);
</pre>
</div>
</div>
</div>

<div id="outline-container-roll" class="outline-3">
<h3 id="roll"><a id="sec-" name="sec-"></a><a href="https://github.com/edwinhu/sas/blob/master/ROLL_REG.sas">ROLL_REG</a></h3>
<div class="outline-text-3" id="text-roll">
<p>
Runs rolling regressions in a computationally efficient way, taking
advantage of SAS SSCP matrices.
</p>
<ul class="org-ul">
<li>dsetin: input dataset
</li>
<li>id: id variable
</li>
<li>date: date variable
</li>
<li>y: dependent variable
</li>
<li>x: independent variable
</li>
<li>ws: window size
</li>
<li>debug: debug mode (n)
</li>
</ul>

<div class="org-src-container">

<pre class="src src-sas"><span style="color: #339CDB;">%INCLUDE</span> <span style="color: #DB8E73;">"~/git/sas/ROLL_REG.sas"</span>;
<span style="color: #D9DAA2;">%ROLL_REG(</span>dsetin=,
          <span style="color: #339CDB;">id</span>=permno,
          date=date,
          y=exret,
          x=mktrf,
          ws=<span style="color: #B5CEA8; font-weight: bold;">60</span>,
          debug=n);
</pre>
</div>
</div>
</div>
</div>
</div><div class="col-md-3"><nav id="table-of-contents">
<div id="text-table-of-contents" class="bs-docs-sidebar">
<ul class="nav">
<li><a href="#crsp">CRSP</a>
<ul class="nav">
<li><a href="#cclink">CC_LINK</a></li>
</ul>
</li>
<li><a href="#comp">COMPUSTAT</a>
<ul class="nav">
<li><a href="#ead">COMP_EAD</a></li>
</ul>
</li>
<li><a href="#util">Utilities</a>
<ul class="nav">
<li><a href="#ff93">FF93_FACTORS</a></li>
<li><a href="#event">EVENT_MACROS</a></li>
<li><a href="#asof">MERGE_ASOF</a></li>
<li><a href="#parfor">PARFOR</a></li>
<li><a href="#resample">RESAMPLE</a></li>
<li><a href="#roll">ROLL_REG</a></li>
</ul>
</li>
</ul>
</div>
</nav>
</div></div></div>
<footer id="postamble" class="">
<div><p class="date">Date: 2020-04-27</p>
<p class="author">Author: Edwin Hu</p>
<p class="creator"></p>
</div>
</footer>
</body>
</html>
